In [25]:
import scripts.sql_parser.sqlite_parser as sql
from scripts.sql_parser.constants import *
from scripts.sql_parser.table_operations import get_table

NC_PATH = '../../data_sets/db/northwind.db'
SC_PATH = '../../data_sets/db/sakila.db'
CC_PATH = '../../data_sets/db/covid19.db'

# instantiate parser objects based on the db path
nc, sc, cc = sql.SqlParser(NC_PATH), sql.SqlParser(SC_PATH), sql.SqlParser(CC_PATH)

# create a table reference for each db for faster querying
nct, sct, cct = nc.table, sc.table, cc.table

In [26]:
# Get all Northwind tables
nc.q(sql.ALL_TABLES)

                    name
0             Categories
1        sqlite_sequence
2   CustomerCustomerDemo
3   CustomerDemographics
4              Customers
5              Employees
6    EmployeeTerritories
7          Order Details
8                 Orders
9               Products
10               Regions
11              Shippers
12             Suppliers
13           Territories

In [27]:
# handle Aggregation functions

nct(name='Order Details',
    cols=['avg=UnitPrice:UP Avg',
          'max=UnitPrice:UP Max',
          'min=UnitPrice:UP Min',
          'count=UnitPrice:UP Count'])

SELECT AVG(UnitPrice) AS "UP Avg",
	MAX(UnitPrice) AS "UP Max",
	MIN(UnitPrice) AS "UP Min",
	COUNT(UnitPrice) AS "UP Count"
FROM "Order Details"

      UP Avg  UP Max  UP Min  UP Count
0  28.850379   263.5       2    609283

In [28]:
# supports most of the clauses (except GROUP BY)

nct(name='Order Details',
              cols=['UnitPrice'], distinct=True,
              where=['&20.0 >= UnitPrice <= 70.0', '|UnitPrice > 20'],
              order_by=('UnitPrice', -1),
              limit=5, offset=2)

SELECT DISTINCT UnitPrice
FROM "Order Details"
WHERE UnitPrice BETWEEN 20.0 and 70.0
	OR UnitPrice > 20
ORDER BY UnitPrice DESC
LIMIT 5 OFFSET 2

   UnitPrice
0     123.79
1      99.00
2      97.00
3      81.00
4      77.60

In [29]:
# simple join (between 2 tables)

nc.join(table_left=('Customers', ['CompanyName', 'Phone', 'Fax']),
        table_right=('Orders:o', ['ShipRegion', 'ShipCountry']),
        shared_col='CustomerID',
        join=INNER,
        limit=5)

SELECT
	Customers.CompanyName,
	Customers.Phone,
	Customers.Fax,
	o.ShipRegion,
	o.ShipCountry
FROM Customers
INNER JOIN Orders o
ON Customers.CustomerID = o.CustomerID
LIMIT 5

,CompanyName,Phone,Fax,ShipRegion,ShipCountry
0,Vins et alcools Chevalier,26.47.15.10,26.47.15.11,Western Europe,France
1,Toms Spezialitäten,0251-031259,0251-035695,Western Europe,Germany
2,Hanari Carnes,(21) 555-0091,(21) 555-8765,South America,Brazil
3,Victuailles en stock,78.32.54.86,78.32.54.87,Western Europe,France
4,Suprêmes délices,(071) 23 67 22 20,(071) 23 67 22 21,Western Europe,Belgium

In [30]:
# multi join (between more than 2 tables, based on different join types)

customers_table = get_table(name='Customers:C',
                            shared='CustomerID',
                            cols=['CompanyName', 'Phone'])
orders_table = get_table(name='Orders:O',
                         shared='CustomerID',
                         cols=['ShipCountry'],
                         join=INNER)
order_details_table = get_table(name='Order Details:OD',
                                shared='OrderId',
                                cols=['ProductId', 'Quantity', 'UnitPrice'],
                                join=LEFT)

nc.multi_join(tables=([customers_table, orders_table, order_details_table]),
              limit=5)

SELECT
	C.CompanyName,
	C.Phone,
	O.ShipCountry,
	OD.ProductId,
	OD.Quantity,
	OD.UnitPrice
FROM Customers C
INNER JOIN Orders O ON C.CustomerID = O.CustomerID
LEFT JOIN "Order Details" OD ON O.OrderId = OD.OrderId
LIMIT 5

,CompanyName,Phone,ShipCountry,ProductID,Quantity,UnitPrice
0,Vins et alcools Chevalier,26.47.15.10,France,11,12,14.0
1,Vins et alcools Chevalier,26.47.15.10,France,42,10,9.8
2,Vins et alcools Chevalier,26.47.15.10,France,72,5,34.8
3,Toms Spezialitäten,0251-031259,Germany,14,9,18.6
4,Toms Spezialitäten,0251-031259,Germany,51,40,42.4

In [31]:
# the same multi join as above, but by using direct dictionaries, without calling get_table()

nc.multi_join(tables=([{NAME: 'Customers:C', SHARED: 'CustomerID', COLS: ['CompanyName', 'Phone']},
                       {NAME: 'Orders:O', SHARED: 'CustomerID', COLS: ['ShipCountry'], JOIN: INNER},
                       {NAME: 'Order Details:OD', SHARED: 'OrderId', COLS: ['ProductId', 'Quantity', 'UnitPrice'], JOIN: LEFT}]),
              limit=5)

SELECT
	C.CompanyName,
	C.Phone,
	O.ShipCountry,
	OD.ProductId,
	OD.Quantity,
	OD.UnitPrice
FROM Customers C
INNER JOIN Orders O ON C.CustomerID = O.CustomerID
LEFT JOIN "Order Details" OD ON O.OrderId = OD.OrderId
LIMIT 5

,CompanyName,Phone,ShipCountry,ProductID,Quantity,UnitPrice
0,Vins et alcools Chevalier,26.47.15.10,France,11,12,14.0
1,Vins et alcools Chevalier,26.47.15.10,France,42,10,9.8
2,Vins et alcools Chevalier,26.47.15.10,France,72,5,34.8
3,Toms Spezialitäten,0251-031259,Germany,14,9,18.6
4,Toms Spezialitäten,0251-031259,Germany,51,40,42.4

In [32]:
# Get all covid19 tables

cc.q(sql.ALL_TABLES)

               name
0  android_metadata
1         csvImport
2           Country
3             !Info
4             Cases
5     CasesPrevious
6   CountryPrevious
7             India
8    csvImportIndia
9        IndiaCases

In [33]:
cct(name='IndiaCases',
    cols=['Confirmed', 'Date'],
    order_by=['confirmed', -1],
    limit=5)

SELECT Confirmed,
	Date
FROM IndiaCases
ORDER BY confirmed DESC
LIMIT 5

   Confirmed        Date
0      94041  2020-06-11
1      90787  2020-06-10
2      88528  2020-06-09
3      85975  2020-06-08
4      82968  2020-06-07